- Pandas
    - one f the data science package
    - used for data manupulation tool,data analysis and data cleaning
    - it is built on numpy packagr
    - developed by WesMCKinney
- Installation
    - for windows
        - pip install pandas
    - for linux
        - sudo apt-get install python3 pandas
- key structures
    - series
    - data frame
- series
    - sequence of data

In [1]:
import pandas as pd
pd.__version__

'1.0.5'

In [2]:
st = 'Hello'
pd.Series(st)

0    Hello
dtype: object

In [3]:
st1 = input().split()
pd.Series(st1)

python program

0     python
1    program
dtype: object

In [5]:
li = [123,'abc','xyz',2.5]
pd.Series(li)

0    123
1    abc
2    xyz
3    2.5
dtype: object

In [6]:
li1 = [1,2,3,4]
pd.Series(li1)

0    1
1    2
2    3
3    4
dtype: int64

In [7]:
t = ('c','k',7)
pd.Series(t)

0    c
1    k
2    7
dtype: object

In [9]:
d = {'Name':'Python','branch':'ALL','Org':'APSSDC'}
pd.Series(d)

Name      Python
branch       ALL
Org       APSSDC
dtype: object

In [10]:
d1 = {'Name':'Python','branch':'ALL','Org':'APSSDC'}
pd.Series(d1,index=['Name','Branch','org'])

Name      Python
Branch       NaN
org          NaN
dtype: object

In [14]:
li2 = [1,2,3,4,5]
pd.Series(li2,index=['A','B','C','D','E'])

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [18]:
import numpy as np
ar = np.arange(4,10)
pd.Series(ar)

0    4
1    5
2    6
3    7
4    8
5    9
dtype: int32

In [26]:
import numpy as np
r = np.random.randint(2,20,8)
r1 = pd.Series(r)
r1

0    16
1    15
2     8
3     7
4     9
5    10
6    10
7    16
dtype: int32

In [ ]:
- synatx[start:end:step]

In [27]:
r1[:6]

0    16
1    15
2     8
3     7
4     9
5    10
dtype: int32

In [28]:
r1[0:6:2]

0    16
2     8
4     9
dtype: int32

In [34]:
r1[1:10]

1    15
2     8
3     7
4     9
5    10
6    10
7    16
dtype: int32

In [40]:
import numpy as np
a = np.arange(1,11)
b = np.square(a)
pd.Series(a)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

In [42]:
num = int(input())
l = {i:i**2 for i in range(1,num)}
o = pd.Series(l)
o

10

1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int64

In [47]:
pd.Series(np.array(range(1,10))**2,index=range(1,10))

1     1
2     4
3     9
4    16
5    25
6    36
7    49
8    64
9    81
dtype: int32

- DataFrame
    - data in rows and columns
    - create and retrive

In [50]:
name = input().split()
pd.DataFrame(name)

python program

         0
0   python
1  program

In [49]:
name = input().split()
pd.DataFrame(name,index=['A','B','C','D'],columns=['DATA'])

python program on pandas

      DATA
A   python
B  program
C       on
D   pandas

In [59]:
data =[['Python','Programming'],['Django','Webdevelopment'],['Flask','Webdevelopment']]
pd.DataFrame(data)
pd.DataFrame(data,index=['One','Two','Three'])
pd.DataFrame(data,columns=['Language','Usuage'])
pd.DataFrame(data,index=['One','Two','Three'], columns=['Language','Application'])

      Language     Application
One     Python     Programming
Two     Django  Webdevelopment
Three    Flask  Webdevelopment

In [56]:
lone = [[1,2,3,8,9],[4,5,6]]
pd.DataFrame(lone)

   0  1  2    3    4
0  1  2  3  8.0  9.0
1  4  5  6  NaN  NaN

In [60]:
d = {'Name':'Python','Branch':'ALL','Org':'Apssdc'}
pd.DataFrame(d,index=[1])

     Name Branch     Org
1  Python    ALL  Apssdc

In [61]:
d1 = {'key1':'value1','key2':'value2'}
d2 = {'key3':'value3','key1':'value4'}
pd.DataFrame(d1,d2)

        key1    key2
key3  value1  value2
key1  value1  value2

In [62]:
d3 = {'key1':'value1','key2':'value2'}
d4 = {'key3':'value3','key1':'value4'}
pd.DataFrame([d3,d4],index=['A','B'])

     key1    key2    key3
A  value1  value2     NaN
B  value4     NaN  value3

In [63]:
d3 = {'key1':'value1','key2':'value2'}
d4 = {'key3':'value3','key1':'value4'}
pd.DataFrame([d3,d4],index=['A','B'],columns=['key1','key2','Key3'])

     key1    key2  Key3
A  value1  value2   NaN
B  value4     NaN   NaN

In [65]:
T1 = {'Name':'Ashok','Org':'APSSDC','Team':'Gaming'}
T2 = {'Name':'Pavan','Org':'APSSDC','Team':'Python','Year':'2017'}
T3 = {'Name':'Chaitanya','Org':'APSSDC','Team':'Android','Exp':'2'}
T4 = {'Name':'Prashanth','Org':'APSSDC','Team':'Django'}
s = pd.DataFrame([T1,T2,T3,T4])
s

        Name     Org     Team  Year  Exp
0      Ashok  APSSDC   Gaming   NaN  NaN
1      Pavan  APSSDC   Python  2017  NaN
2  Chaitanya  APSSDC  Android   NaN    2
3  Prashanth  APSSDC   Django   NaN  NaN

In [67]:
T1 = {'Name':'Ashok','Org':'APSSDC','Team':'Gaming'}
T2 = {'Name':'Pavan','Org':'APSSDC','Team':'Python','Year':'2017'}
T3 = {'Name':'Chaitanya','Org':'APSSDC','Team':'Android','Exp':'2'}
T4 = {'Name':'Prashanth','Org':'APSSDC','Team':'Django'}
s = pd.DataFrame([T1,T2,T3,T4])
a = pd.DataFrame([T1,T2,T3,T4],index=['One','Two','Three','Four'])
v = pd.DataFrame([T1,T2,T3,T4],index=['One','Two','Three','Four'],columns=['Name','Org','Team','Year','Exp'])
v

            Name     Org     Team  Year  Exp
One        Ashok  APSSDC   Gaming   NaN  NaN
Two        Pavan  APSSDC   Python  2017  NaN
Three  Chaitanya  APSSDC  Android   NaN    2
Four   Prashanth  APSSDC   Django   NaN  NaN

In [ ]:
- Retrive Data Frames
    - loc
        - index data
    -iloc

In [68]:
v

            Name     Org     Team  Year  Exp
One        Ashok  APSSDC   Gaming   NaN  NaN
Two        Pavan  APSSDC   Python  2017  NaN
Three  Chaitanya  APSSDC  Android   NaN    2
Four   Prashanth  APSSDC   Django   NaN  NaN

In [69]:
v.loc['One']

Name     Ashok
Org     APSSDC
Team    Gaming
Year       NaN
Exp        NaN
Name: One, dtype: object

In [70]:
v.iloc[0]

Name     Ashok
Org     APSSDC
Team    Gaming
Year       NaN
Exp        NaN
Name: One, dtype: object

In [71]:
a

            Name     Org     Team  Year  Exp
One        Ashok  APSSDC   Gaming   NaN  NaN
Two        Pavan  APSSDC   Python  2017  NaN
Three  Chaitanya  APSSDC  Android   NaN    2
Four   Prashanth  APSSDC   Django   NaN  NaN

In [73]:
# Add column
a['Language'] = ['C#','Python','Java','Python']
a

            Name     Org     Team  Year  Exp Language
One        Ashok  APSSDC   Gaming   NaN  NaN       C#
Two        Pavan  APSSDC   Python  2017  NaN   Python
Three  Chaitanya  APSSDC  Android   NaN    2     Java
Four   Prashanth  APSSDC   Django   NaN  NaN   Python

In [75]:
s

        Name     Org     Team  Year  Exp
0      Ashok  APSSDC   Gaming   NaN  NaN
1      Pavan  APSSDC   Python  2017  NaN
2  Chaitanya  APSSDC  Android   NaN    2
3  Prashanth  APSSDC   Django   NaN  NaN

In [76]:
s.drop(3)

        Name     Org     Team  Year  Exp
0      Ashok  APSSDC   Gaming   NaN  NaN
1      Pavan  APSSDC   Python  2017  NaN
2  Chaitanya  APSSDC  Android   NaN    2

In [77]:
df1 = pd.DataFrame({"num":[1,2,3,4],
                   'age':[25,30,35,40]},
                  index=[2000,2001,2002,2003])
df1

      num  age
2000    1   25
2001    2   30
2002    3   35
2003    4   40

In [79]:
df2 = pd.DataFrame({"num1":[11,12,3,4],
                   'age1':[25,35,55,40]},
                  index=[2001,2002,2003,2005])
df2

      num1  age1
2001    11    25
2002    12    35
2003     3    55
2005     4    40

In [80]:
# combine data on key column or an index
df1.join(df2)

      num  age  num1  age1
2000    1   25   NaN   NaN
2001    2   30  11.0  25.0
2002    3   35  12.0  35.0
2003    4   40   3.0  55.0

In [91]:
df3 = pd.DataFrame({"weight":[80,90,60,70],
                   "num":[2,1,2,3],
                   "age":[50,45,45,67]},
                  index=[2001,2002,2003,2004])
df3

      weight  num  age
2001      80    2   50
2002      90    1   45
2003      60    2   45
2004      70    3   67

In [92]:
df4 = pd.DataFrame({"weight":[80,69,60,70],
                   "num":[2,1,2,3],
                   "age":[50,45,45,67]},
                  index=[2001,2005,2006,2008])
df4

      weight  num  age
2001      80    2   50
2005      69    1   45
2006      60    2   45
2008      70    3   67

In [93]:
df3.merge(df4)

   weight  num  age
0      80    2   50
1      60    2   45
2      70    3   67

In [94]:
# used to combine dataframes on basis of common column or index
df3.merge(df4)

   weight  num  age
0      80    2   50
1      60    2   45
2      70    3   67

In [95]:
df3.merge(df4,on='weight')

   weight  num_x  age_x  num_y  age_y
0      80      2     50      2     50
1      60      2     45      2     45
2      70      3     67      3     67

In [96]:
# used to append dataframes one below the other
con = pd.concat([df1,df2])
con

      num   age  num1  age1
2000  1.0  25.0   NaN   NaN
2001  2.0  30.0   NaN   NaN
2002  3.0  35.0   NaN   NaN
2003  4.0  40.0   NaN   NaN
2001  NaN   NaN  11.0  25.0
2002  NaN   NaN  12.0  35.0
2003  NaN   NaN   3.0  55.0
2005  NaN   NaN   4.0  40.0